[{"overall":5,"summary":"Work Well - Should Have Bought Longer Ones","reviewText":"I needed a set of jumper cables for my new car and these had good reviews and were at a good price.  They have been used a few times already and do what they are supposed to - no complaints there.What I will say is that 12 feet really isn't an ideal length.  Sure, if you pull up front bumper to front bumper they are plenty long, but a lot of times you will be beside another car or can't get really close.  Because of this, I would recommend something a little longer than 12'.Great brand - get 16' version though."},{"overall":4,"summary":"Okay long cables","reviewText":"These long cables work fine for my truck, but the quality seems a little on the shabby side. For the money I was not expecting 200 dollar snap-on jumper cables but these seem more like what you would see at a chinese knock off shop like harbor freight for 30 bucks."},{"overall":5,"summary":"Looks and feels heavy Duty","reviewText":"Can't comment much on these since they have not yet been used (I will come back and update my review is I find any issues after first use) ... but they are built solid, nice tough big hard clamps and love having a long cable so I never have to move cars around or anything if needed. I bought these to have in my new truck since you always need cables ... but another reason is for when I tow my travel trailer and we run the batteries with no shore power they may die after a couple days ... if you are in need a quick small recharge they are the perfect length to pop my hood, run the cables to the back of the truck and hook up to the batteries that are on the tongue of my travel trailer ... running the truck for 30-45 minutes with this nice large gauge wire connected from my battery tot he trailer battery will give me a bit of a charge if ever in a pinch and I have no shore power, solar, or generator to recharge.Bought the bucket boss 06009 jumper cable bag and it fit this 25 footer Perfectly!!!It has no use and is a waste of money right now ... but will EASILY pay for itself the first time you need it ... always be prepared! :)"},{"overall":5,"summary":"Excellent choice for Jumper Cables!!!","reviewText":"I absolutley love Amazon!!!  For the price of a set of cheap Booster\/Jumper Cables in a brick and morter store, you can buy extra long and heavy duty jumpers!  First off, don't be the person that not only needs to ask a kind passer-by for a \"jump\" but also if they have jumper cables.  It's MUCH easier to get a jump start if you have your own cables.Next lets talk about sizing.  Having the longest cable possible is a major plus if your car is parked up against something like a pole or wall, or even parked on a one way street.  The \"booster car\" (the car w\/o a dead battery) can pull in close enough to use the cables without having to manuver into some akward position.  Or better yet, you won't have to push your vehicle into a position to be jumped.  If your diving a normal sized car they can even pull in behind you to jump you!  Or if their vehicle is the shorter of the two, they could pull in front.  Now how about gauge?  For those who aren't electricians or engineers, as the number value of gauge decreases, the size and capacity of the cable increases.  So for example 6-ga has about twice as much copper wire as 8-ga, and 4-ga is a about twice as much as 6-ga, so on and so on.  That doesn't mean you double the capacity of wire with every two numbers though.  4-gauge may sound like a lot but it really isn't.The technical stuff.  Don't worry if this doesn't make sense, you don't really need to know all of this, but I'm trying to make a point as to why to get the longest and heavist cables you can.  I'm not an electrican but I've worked with it long enough to know a few general rules of thumb.  First of the enemy of electricty is resistance.  Resistance ultimately determines the load a particular wire can carry.  Five things factor into resistance.  Temperature, conductor, voltage, load, and distance.  Temp we can't control, so we have to assume the worst (HOT)...or in other words need heavier cable.  Conductor should be copper, or at least a high purity mix of copper...good there.  Voltage...12VDC is a low voltage system...probably the biggest problem we face.  Since is a low voltage system we have to contend with voltage drop as it travels over the wire.  The higher the voltage, the longer it can run with acceptable levels of voltage drop over a particular gauge wire...so again since it's low voltage need heavier gauge wire.  Load (Amperage)...it's a car starter so it takes A LOT of power.  The voltage is a fixed number (more or less) so Amperage is determined by the size of the engine your trying to start.  And you'd be surprised how high that can be.  Even a small engine can be well over 300 Cranking Amps.  That said even a \"dead\" battery will put out some power.  As for distance...this cables selling point is also a draw back.  25' is LONG run for 12VDC.  So like I said in the last line 4-ga isn't as much as you think.  In fact, if you have an engine over 6-liters you should really consider 2-ga for this distance.  So summing up in layman's terms...considering the hot temperatures outside, the fact that it's 12VDC and we need a long cable, and that we're trying to start a car engine (which takes a LOT of power) these are the ONLY cables I could reccomend for anyone driving a small car up to a light truck.Lets talk about how to properly start a car with a drained battery.  Make sure the LAST connection make is the NEG clamp to the \"dead\" car on a frame ground (something metal and NOT MOVING or GOING TO MOVE in the engine compartment.)  Don't attach it directly to the battery's NEG post.  Next lightly rev the engine of the running vehicle for 3 to 5 minutes.  This will put a bit of a surface charge on the dead battery.  Then attempt to start the car.  As soon as it starts remove the cables (starting with the NEG on the car being jumped.)  If you ever have a dead battery for any reason...take it to an auto parts store as soon as possible and have it tested to make sure it still holds a proper charge.  Most places do it for free.  NEVER touch the clamps together once connected to a battery!!!  Doing so could damage you vehicles electrical system, and\/or cause fire, burns, explosion of the battery, damages to your cables...A couple of final thoughts.  Protect your investment.  I bought a cable bag that works really well to keep them from getting tangled with everything in my trunk.  Also keep the twist ties that come with them which will keep them organized inside the cable bag.  And once used, take them home and clean and dry them before storing them once again.  The oils inside of engine compartments can be corrosive to rubber jackets and copper contacts.  These cables are more than worth they weight in gold!  They are inexpensive and top notch quality!"},{"overall":5,"summary":"Excellent, High Quality Starter Cables","reviewText":"I purchased the 12' feet long cable set and they arrived in a retail cardboard box with handle, which could be used as a storage and carrying case for these cables, although I will not need to store them with the carry box.  These are high quality long cables of high grade materials and I believe worth the price I paid for them.  They will store in the back seat storage compartment of my truck easily.  Recomend."},{"overall":5,"summary":"Compact and Strong !","reviewText":"These Jumper cables are heavy Duty, Yet easy to Store. I keep them in one of my containers on my delivery vehicle. They are high quality. They are 4 gauge cable, so they are perfect and long enough to Start are Utilimaster Diesel trucks when are batteries are run Down. There are more expensive cables and even more sever duty use cables. these are perfect for this type of vehicle in an Emergency. The cost is reasonable as well. With 25 feet, you don't have to get real close to the other vehicle. you can pull up to the back and or side and just run the cables under or down the side of the vehicle."},{"overall":5,"summary":"nice cables","reviewText":"bought these for my k2500 suburban plenty of length front to rear. i ended up using them right out of the box as i for a dead battery in my truck. they worked great. several people have complained about the clamps. they worked well for me and i had no issues with poor connections. cables are well made."},{"overall":5,"summary":"for cars and pickups","reviewText":"these are good enough to get most motorized vehicles up and running, for semi and farm equipment, get solid copper."},{"overall":4,"summary":"Coleman Cable 08665 12-Feet Heavy-Duty Truck and Auto Battery Booster","reviewText":"The Coleman Cable 08665 12-Feet Heavy-Duty Truck and Auto Battery Booster are great, heavy and fit perfectly into the Arsenal 5888 Cable organizer.  Hopefully i don't ever need to use them but better to be prepared than sorry."},{"overall":5,"summary":"Beefy","reviewText":"I have an old car, Its bound to need these sometime. I got a set after I gave my old ones to my boss whose truck was acting up. These are long (20') and heavy duty feeling. Usually I'm giving someone else a jump. If I ever have a bad experience with these I will come back and update the review."},{"overall":4,"summary":"fine consumer grade","reviewText":"I seem to use jumper cables at least several time every year; usually on someone else's car. I've &#34;rescued&#34; a few strangers in parking lots because I keep cables in my cars. The 20' length is a safety feature; you shouldn't have to lay these cables across an engine bay to reach a battery. Aluminum wire? Well, these are consumer grade. They'll get the job done at reasonable cost."},{"overall":5,"summary":"Jumper Cables - The Real Deal","reviewText":"All other jumper cables are not real jumper cables.  THESE are jumper cables.  Let me explain.When you're in a bind on some dark night in some parking lot somewhere and your battery is dead, you need to get out of there pronto.In times like that, it's much easier to get a jump if YOU own a set of jumper cables.  It's double good if those jumper cables are long so that they can easily reach the battery of a good samaritan.  Now, according to electrical theory in order for DC current to flow across long distances, you need thicker cable.That's where these cables come in, they're long at 25' and thick at 2gauge.That's what these cables provide, maximum length at near maximum gauge cable.  And yes, your jumper cables SHOULD cost close to as much as your spare tire because that's what you need --- just look up the cost of copper on the market (that stuff is expensive).Yes, you can buy a $17 set of 10 foot, 18 gauge cables out there but if they can't reach between cars or if they can't carry enough power to start your car, you might as well have been lugging a brick in your trunk all those years and you might as well have enjoyed a good lunch with the $17 for all the false confidence it gave you.  I'm serious, buy an extension cord for $5 and you get as much jumping potential as many of the so called 'jumper' cables on the market --- there should be laws against marketing products that cannot jump start a car.  Worse, having no cables or less-than-worthless cables means that a criminal might reach you before you can get a jump and make your getaway.At the end of the day, you want a 25' or 20' cable, so you better be looking at 2gauge or 4 gauge cable - no compromises there.  You can go to 6gauge if you're working your way down to 16' cables.  But, the reality is that you always need a few extra feet when trying to jump start someone's car parked in some tight parking space --- so you're back to the 25' and 2 gauge.Pros- I know I can jump start a Semi with these (more importantly, I can get a jump from a Semi - Truck drivers are the good guys btw)- Extra long at 25'- Parrot clamp are strong, but an average guy can open them with one hand- Copper inserts in the parrot clamps is nice- Clamps are rated at 500amps- they're friggin heavy at near 14lbs, yes that's a pro!  that means there's 14 POUNDS of Copper in there and that's what allows the current to flow as freely as the Amazon river (no pun intended). It's huge.Cons- I do have an issue that the copper cable is not attached to the copper inserts in the clamps, it screws into the metal clamp rather than into the copper insert.  I don't know if that's a mistake or not.  I'm thinking about doing a bit of retrofitting.  I'm sure it's more than enough the way it is.Overall, these are as close an approximation to the kind of jumper cables that my dad had when I was growing up.  He custom made his -- he's old school.Anyway, if you're going to carry jumper cables, and you should --- don't muck around -- spend the dough, get these --- they'll last a lifetime and will not let you down.Advice, after you get a jump don't waste time rolling these things up in some dark parking lot -- just toss the heavy mangled mess into your trunk and get home.  There's always time the next day to roll these monsters back up and get them ready for the next wild adventure you might have."},{"overall":5,"summary":"Great quality","reviewText":"I'm one of those guys who stops and helps people when they need it.  While not a pro recovery guy I use my cables more than the average person.  These fit the bill just right. Strong clamps with a long cable that stays pliable in the cold."},{"overall":4,"summary":"Not sure if they're really 2ga","reviewText":"So these aren't the best cables you can buy.  For that you'll have to go to an electrical or welding supply company and you will PAY!  Probably between 3 and 5 times what these cost!  So unless you plan to start a towing service and need cables that will see daily use, I'd say these are gonna work for you.(Update: After compairing them to the 4ga cables I bought a month or so back for my car, they don't really seem that much thicker...  That's said they are MUCH heavier!  The individual stranding is of a thicker gauge than the other model so I'm guessing that's why the thickness isn't much more...)What I like:--Length - I bought these for a half-ton pickup.  Why?  Because it never fails that your battery will fail to start your engine when your parked in a packed lot with cars on all sides.  Rather than pushing a 3 ton vehicle out you pull the booster vehicle in as close as you can and let the length work for you.--Heft - these cables are no joke.  It's a workhorse grade cable that lets plenty of energy flow.  When trying to start a 5.7L V8, that's kinda important.--Solid Clamps - Unlike some of the other reviews, I don't have a problem opening my parrot clamps with one hand.  But their hardly weak, they'll clamp solid and stay put!(Update: If you really need 2ga booster cables and your skeptical of these, Deka makes a set of 2ga cables for around $150.  I have no personal experence with them but I have a little with the Deka name and they seem pretty good.)What I don't like:--Stiffness - They're not as flexible as I was hoping.  But about as flexible as I expected.  True welding cable in 2ga is about $3 per foot and per cable.  That's why the best jumper cables cost $200+.  Still I was hoping for a little thinner stranding to promote flexibilty.--Cable to Clamp - Like other reviews have mentioned the cable doesn't go all the way to a copper contact connected to the jaws.  Instead.  It's screwed to the body of the clamp then the copper jaws are also screwed to the body.  Still fine I'm sure.So why buy these cables aren't they overkill?  I've had this argument with people before: \"My 6ga cheapies start my truck fine.\"  Well I will attempt to addess this.  As the number in terms of gauge decreases the ammount of conductor increases.  In other words 2ga has more (perhaps 50-100% more) conductor than 4ga.  This doesn't automatically equate to twice as much power but it does certainly allow more power to flow safely.  For those that aren't aware (and I'm not an electrical engineer here), resistance is the enemy of all electrical circuts.  Resistance translates to heat in the same way that friction does when two physical surfaces rub together.  Five basic factors contribute to resistance in a give curcuit and determine the appropriate line size.  Ambient temperature, conductor, line distance, voltage, and amperage.  Ambient temp we have no control over.  Hot is bad so just assume the worst.  This means bigger cable to overcome the additon resistance heat is producing.  Conductor of these is copper so that's good.  You want pure or at least a high purity mix of copper in this type of conductor.  Distance and voltage.  One of these cable's strengths also happens to be a weakness.  Total run length for this circut is 50'.  Pretty long for a low voltage system like 12VDC.  The higher the voltage, the longer it can run on a given gauge wire without encountering too much voltage drop.  12VDC drops voltage on a circuit in a realatively short distance.  So heaiver gauge lines are needed to prevent this.  Amperage is also a big consideration.  The more amps a load pulls the more resistance the circut will generate.  Basically on a small wire, a large load will generate a lot of heat and one of two things will happen. 1) the wire will melt and\/or catch on fire.  2) The load your trying to power won't work.  And make no mistake, starting even a small engine takes a LOT of energy!  So bringing it all together.  Large load, low voltage (that we don't want to make in lower), and a long distance run means that you wan the heaviest cables you can find.  Addressing the orignal question and statment.  6' 6ga cables might start your small-block fine.  But if you want or need the extra length, you need to consider heavy gauge cables.  That said I've personally seen light duty cables melt and smoke from starting an engine too big for them.Are these right for you?  So these will run you close to $100 shipped...do you actaully need them?  I own both these and the Coleman 4ga 25' booster cables.  Having no offical training and with no real sizing charts on the packaging I would say this.  The 4ga will do you fine at the 25' length for engines up to 5-liters or so (and honestly probably up to about 6L as well.)  Anything bigger than that and you should be considering these or something even better.Also protect your investment.  Buy a cable bag for them to keep them neat and protected.  Also keep the twist ties that came with them to keep them organized inside your bag.  I have the Arsenal #5888 cable organizer and it works great for this.  Remember too to clean and inspect your cables after each use to prolong their life and keep you safe."},{"overall":4,"summary":"Plated copper wire from what I see","reviewText":"It is hard to find pure copper cabled jumper cables.  The add for these gave me the confidence that I was getting just that.  After arrival I noticed the plated copped aluminum wire :(.  Not a deal breaker as they are well built and will most likely do what I request of them."},{"overall":4,"summary":"Only 4 stars because I haven't used them","reviewText":"These are an insurance policy for my Land Rover.  An ounce of prevention is worth a pound of cure.  These are heavy weight and appear to be solidly built.  As I haven't used them, it's difficult to talk about function.  That being said, I'm happy enough with the construction to give them a solid 4.  You get what you pay for, and this is certainly worth it."},{"overall":3,"summary":"Does what I expected it to do.","reviewText":"This product serves its purpose. I use it for hauling canoes to and from our cabing. If I would have had time I could have made this myself for about $30. It is very sloppy if you don't secure it with ratchet straps on each side back to the truck. Works good though if only going short distances and moderate speeds."},{"overall":4,"summary":"Extend-A-Truck 944 Truck Bed Extender","reviewText":"Hitch extender is good for Kayak transport and allows me to secure slippery kayaks to bed, with minimal effort. There are rings on Tee, allow straps and Bunge Cords to effortlessly secure boats to bed.  After securing Kayaks in place with Rope and cords, this method of support and tiedown of ends of Kayaks just makes sense.  Good product, Well made and painted with good coating for corrosion resistance.  Stores easily or hangs from hooks on Garage wall, though it is somewhat weighty.  Yo lil' mamma will struggle to move it, but that's why you have one! Also mounts to support cab level or bed rack level loads like ladders. The ladies will like it's slender frame. You yakkers with hitches, should get you one!"},{"overall":5,"summary":"No Brainer, Easy to Use, Sturdy","reviewText":""},{"overall":5,"summary":"Easy install","reviewText":"Package arrived a bit ragged but it was all there, easy to install, takes less than 5 minutes, works as described. We used it on my F150 crew cab truck to haul my wife's paddle board. Would suggest to anyone looking for a product like this."},{"overall":5,"summary":"Love It!","reviewText":"This was exactly what I needed for transporting my fishing kayak in the bed of my F-150. Easy to assemble and works great!"},{"overall":4,"summary":"Great idea","reviewText":"I bought these to haul my two kayaks.  Works great.  I would have given 5 stars, but it does not come with any reflectors or padding material.  Also, the flag it comes with was missing my first order, Amazon sent me a new one, but the flag is real cheap...just a piece of red thin plastic."},{"overall":5,"summary":"Good design and solid construction and compact","reviewText":"I have owned trucks for many years and gotten by with long lumber though not without some problems from time to time. I originally bought this for use with my kayaks which are 14' long to carry them in the back of the truck with its 6.5' bed. Instead I have been using this extender at least 3 times a month to transport long items.The two pieces fit one inside the other and the overall length is short enough that I can store it behind the seat of the truck until needed. The tubing is heavy enough gauge to support the rated load with no flexing. The two pins needed to attach it to a hitch receiver and to connect the two pieces are provided. The cross bar as multiple holes so I could adjust it for the height of the bed of my truck.There are end loops to use to tie a load and secure it to the bar. The center post also works well as an attachment point for lumber and pipe.I saw similar racks selling for more than twice as much that provided often less strength and no more versatility than this one. Usually after I have tried something like this I see things that I would improve in the design but not so with this bed extender."},{"overall":5,"summary":"Perfect for my outside car!","reviewText":"This is a must for anybody who wants to keep their car clean between washes. My car sits outside, in parking garages, and old sheds. All of them seem to dump tons of dust on my poor car. This model comes with the wood handle. Others out there have a cheap plastic one. Read the directions on the cover. You're suppose to let it air out after shipping. It has something to do with the wax on the brush. It also will tell you not to worry about it getting dirty. In fact its suppose to work better as it gets dirtier. The duster will work even better if you put a sealant and\/or wax on your car. You'll find that you can pull a lot more material off your car. The duster will easily remove pollen, dust, and any other light coating of material. It will remove the dust from hard water and rain deposits, but you'll still see the marks if you look carefully. Buy this product. You're call will thank you!"},{"overall":3,"summary":"average","reviewText":"this product does what it is supposed to do, but, I am not real happy with the quality of construction."},{"overall":2,"summary":"Does what it is supposed to","reviewText":"I would not buy this product again. It does what it should but If I had to do it again I would just stick with detaling microfiber towels from Viking\/Cobra."},{"overall":5,"summary":"GREAT FOR THOSE WHO TAKE PRIDE IN THEIR RIDE","reviewText":"I own the Original California Car Duster and it works very well.  It is great for touch up cleaning in between car washes.  It is true what they say about the more you use it the better it cleans.  If you use it a lot it will start to turn black but it will start cleaning better than ever.  It is great to wipe light dirt and dust off your car and makes it look like you just waxed your car.  If you take care of it then it should last for many years."},{"overall":5,"summary":"Gentle yet effective","reviewText":"Like most car detail enthusiasts, I never liked to see 3 hours of detailing work destroyed in a couple of days of driving and parking. With this brush, my detail jobs last longer. The brush is gentle on the clear coat but it does sweep the dust away, leaving water and and bird droppings behind.For best results, I recommend that you clay clean the car with a good car clay and wax it with S100 car wax every few months. Then using this brush, you can maintain your car in show room condition for a long time without having to wash it."},{"overall":5,"summary":"What to say","reviewText":"Takes the dust off my car without leaving any streaking that some report with other brands. Just don't press real hard."},{"overall":5,"summary":"The best car duster","reviewText":"Really the best car duster out there in my opinion. Used others and they are cheap and fall apart easily. This one really gets the job done. Had it for almost two years now. Too bad I can't find where I put it :\/"},{"overall":5,"summary":"A must have","reviewText":"I've been using one of these for years and I'm on my second one. This duster works exceptionally well and lifts the dust without dragging it around. I will NOT make a filthy car that hasn't been washed in weeks or months look clean. You must either keep your car in a garage, or use a cover like I do, and dust it daily to keep it looking clean. If I wash, clay bar, and wax my car I can go two months or perhaps more without washing it again, as long as I keep it covered, dust daily, and wipe it down weekly with an instant detailer. The fibers are impregnated with a paraffin wax so don't just lay it on something if you don't want it to be stained because of the wax and dirt. Also, if there is condensation on the car it really renders the duster ineffective so make sure it's dry before using it."},{"overall":5,"summary":"The Best","reviewText":"This thing is great. I had another one from a different company that broke because the handle was plastic. This is wood and it feel a lot more solid. I have a black car and this takes the dust right off. Great buy! 10 out of 10"},{"overall":5,"summary":"quick and easy dust removal","reviewText":"The California Car Duster has been so much more than I expected. I keep a good finish on my car and it is garaged year-round. Washing the car was (many times) simply a matter of hosing off the dust. This does a damn nice job of dusting all of the car surfaces quickly and easily. Sometimes I get lazy and the car duster saves me a full car wash. Try it!"},{"overall":5,"summary":"california duster","reviewText":"As we all know, dust gets over your rides in the garage, and is nice to be able to dust it off instead of complete re-detail!."},{"overall":5,"summary":"A Detailers Dream Come True","reviewText":"Have used a California Duster for over 15 years on brand new and old car finishes, from black to white. This duster keeps a relatively clean, maintained car looking show room shiny and takes only minutes to use. How many things out there can give you a spiffy shine in a couple of minutes?The key to using the Duster is to follow the clear instructions provided. You MUST let it dry out a day or two before initial use. It has a waxy coating on the fibers (all the more reason it DOES NOT scratch the finish) and it has to dry out before initial use. Have read a couple of reviews that claim the Duster scratches, but suspect it is because they didn't let it dry out. The one time I forgot to do that, it looked liked it scratched (scared the daylights out of me!), but it was just swirls on the surface from the moist wax - easily removed. And, if there is moisture on the car's surface, it too will look like a swirl or scratch until it dries.Second, it is is a DUSTER, NOT a scrub brush. Only to be used on finishes that are otherwise clean but have dust\/pollen on them. If you scrub with it to remove mud, splotches, bird droppings, etc., it WILL scratch, just as dry rubbing a car's finish with ANYTHING will scratch it. You let the Duster do the work, lifting the dust right off the car. Doesn't just push it around, but actually lifts it off.Maker claims it only gets better with time and dirt, but of course can't figure out how that could be true. BUT, have never noticed any problem with use and dirt accumulation. Tried washing once, which maker says you can do, but seems to remove the waxy coating and defeats the effectiveness. Ya, it may last forever, but I buy a new one once a year - hey it's pretty inexpensive.Be the envy of neighbors, get one of these and be as amazed as they will."},{"overall":3,"summary":"cheaply made, picks up some dust but leaves behind even more red fibers","reviewText":"Maybe I don't understand the finer points of keeping your car clean, but it seems to me that whatever instrument one uses to dust their car should not leave behind more lint and strands of fabric than it picks up."},{"overall":5,"summary":"Works as promised","reviewText":"This product is an effective way to remove dust and pollen in between car washes. I have used it for several years without any problems, and recently bought a new one to replace the one that got ruined in Hurricane Irene this past summer (my garage was flooded). Here is why I like it:1. This cleans without harming the car finish or leaving streaks.IMPORTANT: Follow the directions to place this on newspaper for 48 hours before first use. That is to get rid of excess wax that can cause streaking.2. This covers a large area, so the time to clean is reduced.3. This is easy to clean (just shake it out) and works great no matter how dirty it gets.4. This is well made and durable.Note: This is not a substitute for going to a car wash or using other cleaners. It does nothing, for example, to remove water spots or bird droppings. It also does nothing to give your car the shine that only wax can do. But it is a great way to maintain your car in between car washes."},{"overall":5,"summary":"Second One","reviewText":"The first worked so well I decided to purchase a second to keep in the car.  Not why, but as advertised the dirtier it gets the better seems to work.  As long as you use as suggested, dust your car, and not try to clean heavy dirt with it, it will leave your car spotless."},{"overall":5,"summary":"Must have for keeping your car cleaner between washes","reviewText":"Amazingly wipes off dust keeping your car cleaner between washes. If you have a black car, you want to buy this product and use it often."},{"overall":5,"summary":"Great! I wish I knew about this product earlier!","reviewText":"You can trust that this item works well and does not scratch your paint. I was always skeptical previously and just asssumed these things scratched the car. But my paintless dent removal guy uses one and highly recommended the California Duster to me. He is fanatical about keeping his car totally detailed. And this product works so well that he never even washes his car unless it gets rained on. He just dusts it every morning before he backs out of his garage, and if needed he uses some liquid instant detailer and a microfiber cloth after dusting if he feels like it. It takes a total of less than 2 minutes to dust off an entire car, yet the result makes your car look like you just washed it.I use the California Duster before putting on my car cover so that there is no dust between the car and car cover. If you have a garage, it's quite useful since dust settles on the car during the day when you are out and about and at night, even garaged. You won't have to wash your car as often if you use the California Duster. And dust won't build up if you use it often enough.Before discovering the California Duster, I found that after washing my car, I could only use my car cover for a few days before the car got too dusty to put a cover over. Now I find that I can keep the car dust free and use the car cover for much longer, which in turn means I don't have to wash the car nearly as often.I got the plastic handle California Duster which was significantly cheaper at the time I ordered. Although the wood handle one looks classier and probably feels nicer, the plastic handle one feels plenty sturdy, for the value oriented, get the plastic handle one since it's the exact same brush anyway!I am really very happy with what I paid for the Calfornia Duster and would not hesitate to recommend one to anyone with a car or motorcycle. Just be aware what it is not made for a car that is wet or very dirty. My only complaint is that it is not actually made in Calfornia."},{"overall":5,"summary":"The Original Car Duster is the Best","reviewText":"I gave a five star rating because of past expierence using this product.The first California car duster I had recieved as a gift  lasted 15 yrs.I bought a new one 5 yrs ago its still doing a good job and use that for my work truck.t I wanted to buy  one for my wife's vehicle..I like the wooden handle FYI follow instructions about putting it on a newpaper for 48 hrs.It will show some streaks the few times of use.They have to get broken in and it does a great job.I highly recommend this product."},{"overall":4,"summary":"Still does the job","reviewText":"People were complaining about streaks but this works just as good as my 10 year old model it replaced. The handle feels a little cheaper but I haven't had any issues. Then again my car is white and maybe any streaking is harder to see. Just be sure to leave it out on some newspaper for a few days for best results."},{"overall":5,"summary":"Perfect Size","reviewText":"I purchased this item for dusting on my Harley. It easily gets into hard to reach areas to keep them dust free. I also have used it for dusting in my automobile where it works well. I would recommend this product to all my friends. I do own the full sized California Duster for exterior dusting and the full size interior duster. They all work perfectly."},{"overall":5,"summary":"VW Beetle Dashboard Finally Clean!","reviewText":"The mk4 Beetles have a dashboard made of a ridiculous rubber\/plastic material that gets sticky when the sun heats it up.  Why VW chose to use this material is beyond me, but I know that the mini california duster is the ONLY product I've found that can successfully clean the dust off of the dashboard.  It sounds trivial, but this is a really great product for the reason that it achieves what no other product can (or so I've found)."},{"overall":5,"summary":"Just perfect size  for interiors . Cleans dash and instrument panel perfect .","reviewText":"I Love it  . Takes a while to break in until then you may get some wax streaks and not pick up all the dust but within a month it is perfect and like they say only improves the dirtier it becomes just shake off outside before putting back in the case and stuffing it in the trunk or map pocket ."},{"overall":5,"summary":"works great","reviewText":"One of the best things I have bought to keep the inside of my car clean and looking new.  I recommend this for everyone."},{"overall":5,"summary":"Gets the dust off your dashboard","reviewText":"The dash of my black car is anthracite gray, and it shows dust easily. The California duster is created for either exteriors or interiors of cars and is impregnated with paraffin wax. This picks up the dust and the soft fibers float over the uneven surfaces of the car interior, picking it all up in one swipe.I keep this in the car and once a week I swipe down the interior all over to keep the car sparkling clean. It's small enough to keep handy under the seat.This makes a really nice gift for someone to congratulate them on their new car, or for someone who likes doing their own detailing."},{"overall":3,"summary":"Leaves red lint. Good otherwise","reviewText":"Bought this for my 2013 Evo x gsr. It left red lint all over my dash. If using in the house I'm sure it's fine as you won't notice. But this brush DOES leave red fibers behind"},{"overall":5,"summary":"Nice product, not sure about previous negative reviews","reviewText":"I've used a California Duster in the past with other vehicles and loved how it sucked up dust and dirt and held without scratching my finish.  I had gotten away from super-anal car care the last few years but with a recent purchase of a brand new 2014 Subaru XV Crosstrek, my Automotive wishlist her on Amazon has been growing and another California Duster has been towards the top of the &#34;Really Want&#34; list.I still have my old Original California Duster and it works great (like fine wine, it got better with age) but was mostly interested in this smaller one for the interior.  I have a dark grey\/charcoal colored interior that is patterned and almost feels 'sticky' to the touch for lack of a water word.  Using a microfiber cloth didn't really clean up the dust too well and another duster I picked up here works ok on the radio console and steering wheel but not on the dash itself.Despite a few negative reviews here I decided to give it a go after a recent price drop.  Picked this up for $4.63 when I figured I didn't have much to lose.Put it out on the porch for two days on a stack of newspapers as was suggested.  After that I gave it a bunch of really good shakes and then ran my fingers thru the fibers a few times trying to get out any of the lose ones.  That seemed to do the trick because I haven't had any issues with stray red fibers all over the place or the pad falling apart as I've read in previous reviews.Shortly after I went out to the car and cleaned the outside and the inside.  Shook it out a bunch and it seemed to work great on the dash which has been a PITA since I bought the car.  Afterwards I brought it inside and used it to dust my entire first floor of my house.  This included behind my tv and entertainment center, on top of my refrigerator and all those other places normally buried in dust.  Worked like a charm, sucked it all up and didn't let go.So I'd have to say this, just like it big brother, the Original, works like a charm.  For anyone having other issues like red fibers all over the place, I'd recommend following the steps I did listed above, it worked great for me and as of now I have a great little duster that I paid less then 5 bucks for.  IMO, u can't beat it."},{"overall":5,"summary":"Pretty easy to use","reviewText":"I had a cracked air intake hose that caused the \"check engine\" light to go on, but a couple days after I fixed it.  I wasn't sure if that was the reason, and if it was, I didn't want to take it to a dealer just to clear that code.This did the trick.  Very easy to use, gave me the code so I could check what it was. Once I found out, I knew it was the cracked hose.  Cleared the message using this unit, and it never came back.  Had I taken it to a mechanic or dealer, they'd probably have told me it was some other problem and I wouldn't have know if they were telling me the truth or not."},{"overall":5,"summary":"great buy","reviewText":"this scanner works just like they say you have everything you need to scan your auto. WORTH EVERY PENNY!!"},{"overall":4,"summary":"A good tool for $89","reviewText":"I purchased this Acton scanner 2 years ago when our older vehicle was repeatedly showing its MIL (Malfunction Indicator Lamp). I was able to clear the code immediately. When the MIL illuminated again later, I was able to track down the problem (O2 sensor heater trouble)and correct it by reseating the connector. Later, I used the scanner to diagnose which cylinder was misfiring. By tapping on that cylinder's fuel injector, I was able to correct the misfiring. Again, the Acton cleared the MIL display.My mechanic uses a more sophisticated (and much more expensive) OBD scanner in his day to day work, but for someone who does occasional maintenance on his own car, this tool is worth the $89 investment. If you paid more, you paid too much."},{"overall":5,"summary":"Actron Auto Scanner","reviewText":"Actron seems to be a company that makeshigh quality diagnostic equipment. This autoscannertool is very affordable and excellent value formoney. Works very well and is pretty ruggedas I had hoped. The only problem is that fixingthe vehicle based on the diagnosed code isNOT always helpful, sorry. Repairing your car based on thesecodes requires a good understanding of auto repair.For example: code PM001 - Cylinder Misfire. What can a NOVICEdo with ALL that \"helpful\" information (LOL). Relatively easy to use.I will give full marks for the quality of thephysical device otherwise."},{"overall":5,"summary":"An inexpensive tool that can save you a ton of money!","reviewText":"I used to take my car to the mechanics and they would hook it up to their diagnostic machine. If they diagnosed my car and I didn't use their services, the fee was $50. Otherwise, if I used their services it was a free diagnostic but I had to pay for the repair. Now I can self-diagnose my car and instantly know what is wrong with it before shopping around for the repair. I used the Actron CP9135 today when my air conditioner was not blowing at all. I had forgotten that I purchased this a month ago and I called my husband to ask him if I should take the car to our mechanic. He told me to go home and hook this up and see if it can tell me what is wrong with the air. After a dozen or so tries to get the air on, I went inside and got the Actron CP9135 and hooked it up. I then turned the car on and the air worked fine and no error codes were reported. I am not sure if this is true, but my husband said maybe it reset the cars computer? Who knows, but it did save me a trip to the mechanic and it gives me peace of mind to know what is going on with the car. I am going to keep it in the glove compartment for future problems.Update Dec 20, 2007: My car was shuddering a bit at low speeds and stops. I immediately plugged this in and found out that my 6th cylinder spark plus was not firing. Took it to the mechanic and had my spark plugs replaced. Saved $109 off the dealers \"diagnosis fee\"!"},{"overall":5,"summary":"Pay no attention to that man behind the curtain...","reviewText":"Have you ever felt like your auto mechanic was \"Mr. Wizard\"?  All the way down to the bad attitude?  Only to find he has a doo-dad sitting somewhere out of eyesight that tells all, like a crystal ball...Well for a reasonable price you can get your own crystal ball.  It might be able to predict the future and track flying monkeys but it can tell you very quickly why the \"Check Engine\" light has come on.  Big or small you know what might be waiting for you when you go see Mr. Wizard.  Sometimes you might even be able to track down the problem yourself and cut the cost to fix it.I would not go to Oz without mine!"},{"overall":5,"summary":"Cheap and works","reviewText":"This is cheap and it feels cheap, but it works and thats all that matters. I have one on the floor and two on the ceiling for months."},{"overall":4,"summary":"Not quite what I thought it would be.","reviewText":"The price was right and it was delivered on time, however, it was not as durable as I imagined and was a little smaller than it looked to be in the picture.  It was also a little flimsy when extended to it's supposed maximum size.  I would not buy it again as my vents are larger and this is just not adequate for the intended purpose.  However, if the vents were not as wide, it would be acceptable."},{"overall":5,"summary":"Exactly what I needed","reviewText":"I have two vents directly over my living room sofa and although I have lived with them blowing directly on me for a long time, a suggestion by a friend, had me search out diffusers.  I am really glad that I did.The diffusers work great in re-directing the air flow off of me and either into the room or towards the windows.  The magnets hold perfectly on my ceiling vents and the diffusers appear pretty sturdy.  So far, nothing has fallen to \"crack me in the head.\"The diffusers are adjustable so that you can get them to fit even if you have a vent lever or screws that may get in the way, which I do.I am very pleased and would recommend this product in that it absolutely helps."},{"overall":3,"summary":"Simple and somewhat effective","reviewText":"This air deflector makes the air go to the side.  That's all it does.1. There are 2 pieces and no printed instructions - just the box where you can see how to assemble.2.  The 2 pieces fit together by grooves.  Slide and you can adjust by pulling\/pushing to get it to fit on vent.3.  Magnets to hold this on vent.  The magnets aren't strong but - barely strong enough to hold on the ceiling.There's nothing good to look at with this deflector.  It kind of disappears since it's transparent plastic.If this will fit your vent, just get one.  See how you like it and you can order more later."},{"overall":5,"summary":"Premium Air Deflector","reviewText":"This air deflector was installed beneath our chest of drawers in the bedroom and is successful at getting the air stream into the main bedroom more quickly. The fact that it can be expanded to cover our 12&#34; wide vents is a plus."},{"overall":5,"summary":"Well built and looks nice","reviewText":"This product did a great job of balancing the temperatures throughout my home by correcting the direction of the air flow. The magnets are super strong and the materials super clear."},{"overall":5,"summary":"Works Very Well!","reviewText":"The deflector does a good job navigating the air in the direction desired and the magnets reliably hold it in place on a vertical vent in a wall. I am happy with the product, happy enough to order another one!"},{"overall":5,"summary":"Bought this for a ceiling vent","reviewText":"I purchased this product for my parents to use on a ceiling vent.  They were pleased with the product overall.  It was sturdy, easy to install, and serves the purpose of the purchase.  They said the magnet held on well also."},{"overall":5,"summary":"Works","reviewText":"I put this over the ceiling vent in my bedroom and it does the job. The magnets seemed stronger than those on the one I put in my living room, purchased locally. My vents size required this deflector to be pulled out to it's max length which put it right on the edge of not holding together but it does and it does the job. It has been up there for several day's now and I expect no problems from it."},{"overall":5,"summary":"Works as intended","reviewText":"Five stars for price and for doing exactly what it is supposed to do.  It also seems to be unbreakable in that it survived shipping.  Amazon didn't pack the box very well; I guess taking the manufacturer at its word and the claim that it is unbreakable.  I purchased two of these, both of which came in boxes that were utterly smashed up by heavier items in the box.  Both arrived unscathed anyway, although with one, the two halves had come apart.  It slid back together easily, so no big deal.I am using these on standard HVAC registers in our new house.  In two places we ended up needing to place furniture over top of a register.  We wanted something to direct the airflow out from under the furniture instead of blowing air into the bottom of it.  These do that well, and the magnets have held them in place.  Just slide the sides apart to the width you need and set them down.  Done.  I would recommend them, and will buy more if we rearrange things and need to cover other registers."},{"overall":5,"summary":"excellent vents","reviewText":"I ordered two models of Deflecto vents and both are outstanding.  Heavy duty plastic, large strong magnets on the side and they work perfectly.  Would recommend to anyone, especially since these are impossible to find locally, just try asking for one in your local home depot\/lowes, they're never even heard of the product."},{"overall":5,"summary":"20 years old and still in good shape","reviewText":"I bought my first air deflectors (this same model) 20 years ago from Lowe's for my 4\" x 10\" floor registers. I've stepped on them from time-to-time and have never broken them. However, I did break one recently when I moved my sofa - not the deflector itself but one of those little tabs that hold it together in the center, so I'm back to buy another. I wasted a lot of money prior to purchasing these unbreakable ones with the other type that don't flex and that break easily. The magnets are very strong, when I lift these up for cleaning, I pull the entire metal register out of the floor. The magnets are strong enough to hold tight on registers that have several coats of paint on them, too."},{"overall":4,"summary":"Decent lock for under $10","reviewText":"I'm using this to secure the spare tire on my utility trailer. It has a nice thick cable and it's not too long like a bicycle cable lock. Tubular locks are not my favorite, but overall this device seems like a pretty good deterrent for the casual thief. I did notice that the ring on one end of the cable was drilled out way off center. Maybe not the best quality control? (See it in the pic I posted.) I'm pretty happy with it overall and would recommend it without hesitation."},{"overall":5,"summary":"'09 UNL Wrangler X","reviewText":"The Wrangler spare is held on by three lug nuts, the other holes are covered from the inside by the mount so you can't get this cable thru any of them.  The only way is to drill a hole thru one of the other two holes and thru the mount.  This takes the simplicity out of using this cable lock, obviously.  But if you're willing to do this, it just takes a few extra minutes and then the lock works great on it.  I'll probably also add a locking lug nut to mine for added theft deterrence.  A cable lock isn't foolproof but it gives you another level and at this price why not?"},{"overall":5,"summary":"Works great","reviewText":"I added this to my spare on my boat trailer. It was plenty long and built well. Not much else to say."},{"overall":5,"summary":"Very useful and effective!","reviewText":"This works perfectly and sets my mind at ease with all the light fingered individuals out there ready to lift your battery, propane tank and whatever else they can get their hands on.."},{"overall":5,"summary":"Something Every Jeep Owner Needs To Think about, How To Protect My Spare","reviewText":"It is perfect to secure your spare tire to tire carrier or bumper. Easy to use and sturdy. Is not a eyesore, and seems well made, i highly recommend this to keep thieves honest, it wont guarentee a determined thief wont steal your expensive wheel\/tire, but when the thief see's the steel cable wrapped through the wheel, it won't be so much a snatch and grab. Some piece of mind to myself. I run 31.10.50 x 15&#34; wheels (over $350 each wheel\/tire x 5 = $1750), with a Smitybilt tire carrier, the 36&#34; cable was plenty long enough."},{"overall":3,"summary":"Just OK","reviewText":"This lock will only suffice to keep honest people honest.  It is far too easy to just cut the cable.  It is however a good deterrent.  I still would recommend it just for it's deterrent aspect."},{"overall":5,"summary":"great","reviewText":"This is just what I was looking for,  perfect size for the spare on my 90 4runner.  Looped it through the spaces in the wheel and locked in the back.  Nice for the added security."},{"overall":4,"summary":"Seems alright","reviewText":"This lock appears to be nearly identical to the old masterlock design.  That one built up rust inside the lock mechanism, so this will probably do the same. It is a few mm's shorter than the masterlock and barely clears my curt hitch holes, so you may want to try before you buy on this one."},{"overall":5,"summary":"nice clean stainless steel design","reviewText":"this is a very nice stainless steel design.  Mine was a bit longer than necessary so I put a few O-rings on the pin to keep it from rattling.  The rubber cap covering the key hole could be a better design to fit more securely but I'd buy it again."},{"overall":4,"summary":"Receiver lock","reviewText":"Considering this is made in China, it is a quality product, too bad all my locks are keyed to the some number"},{"overall":5,"summary":"I like it so far, very well made. I oiled it up good before placing it on my vehicle","reviewText":"So far I like this lock set up, I live in the Four Corners area of NM, I hope to not have the rusting problems some reviewers have had in the wet slushy climates."},{"overall":4,"summary":"saves your trailer breaks your nails","reviewText":"man it's hard to come up with a title for this. and it's a mixed reviewIt works.  It's metal, strong, rust-resistance (it's not a grade of rust-proof stainless as there are already spots from road-salt), but given the narrow space where it fits, it's difficult to get the locking end on and off.  It's hard to get a good grip on it,  even with the knurling on the ends.  But the ends ARE small enough so there's no interference with other hardware.  The hitch on my truck is just wide enough outside that there's almost to end-play on the lock shaft which makes getting the end on even more difficult.  Takes some getting used to.  I don't think there's a better product out there though, which makes this worth the price."},{"overall":5,"summary":"On the Road","reviewText":"We use this when we'll be on the road (more than 250 miles). We go to Maine every year from Florida and I do most of the driving at night when a cleaner windshield is nice to have. I mix it with distilled water and their 2 in 1 glass cleaner. While on the interstate I rarely need the windshield wipers if I clean the windshield well before heading out."},{"overall":4,"summary":"Good but...","reviewText":"Although the treatment does a good job treating the windows, I have found that removal is not that easy. You have to work at removing the residual haze. I usually have to wait two days to remove the haze entirely."},{"overall":4,"summary":"Simply works","reviewText":"Been using these since the 70s.They simply works. Read the instruction.But may require frequent application , depending on the weather and wipers usage.The coating does wear out with use and by the sun"},{"overall":5,"summary":"Good for all seasons","reviewText":"I really appreciate the Rain X in a light drizzle or mist, when the water seems to disperse by itself with minimal windshield wiper use. When you apply before the cold weather, though, it helps prevent ice from sticking to your windshield, which is just great. I also like to use the product on the back window, which doesn't have a wiper, because it keeps the window clearer. Follow the directions--let it dry to a light haze and wipe it off with a microfiber or paper towel until the windshield is clear. I'm sure you'll like it."},{"overall":4,"summary":"Great stuff, the original","reviewText":"This is the original product.  Really great stuff.  Works so well; when rain hits, you'll be so happy you applied it.  Rain just sheets off; you don't even need wipers on.This package includes a LOT of product.  A huge improvement from the small, single-use packages they used to make (or maybe they still do); this is a much better value.The only downside to this product is the seal; there's a little spout on the bottle top that goes up and down; you flip it up to dispense the product.  It seems pretty flimsy, and doesn't seem to seal very well when closed.  I have a feeling some of it is going to evaporate out of the bottle, and at some point some will spill out if the bottle is ever turned on its side.  Other than that, great product."},{"overall":5,"summary":"Makes driving in the rain easier","reviewText":"Before I applied this to the windshield of my car, I noticed that the wiper blades, although new, left some streaking on the glass, and it could be a bit of a challenge to see outside especially when it rains hard and the raindrops magnify the lights of cars or the streetlights. After application, the wiper blades no longer left streaks, it became much easier to clearly see outside and the water beaded and blew away. At times, it may look like there is no rain on the glass when driving through rain at night.It works so well that I purchased another bottle when my first one began to run out."},{"overall":5,"summary":"rain-X awesome","reviewText":"I can't say enough about the quality and benefit of rain-x for treatment on my windshields.  my cars and bikes love it."},{"overall":4,"summary":"it works temporarily","reviewText":"i used it on my windshield and bathroom shower door.it works for like a week. for the amount of time it took to apply and polish off, it should last longer.make sure to wear a filter when applying indoors. this stuff stinks."},{"overall":5,"summary":"This is a great product for improving road safety and keeping your windows clean!","reviewText":"This product takes time to put on right but it is worth the effort.  When you are done you will not believe the results when you get into a rain storm.  Your windshield glass is so slick that the heaviest rain just slides right off without using your wipers.  Your visibility is improved dramatically and you can see what is going on around you.I use it often but especially when I am going on a long vacation drive.  It improves your driving safety in inclement weather and helps to keep your family and you safer. I use it on the outside of all of my windows of my vehicles.  It is good for rain, sleet and snow and even reduces the amount of bugs that will stick to your windows.  The treatment lasts for about 3 months.  It is only recommended for glass.The further you can see the better your response time to stop in case of an emergency.  I strongly recommend this product as doing a great job!"},{"overall":4,"summary":"Rain x","reviewText":"This is my first purchase of rain-x. It seems to work pretty well. I do wish it lasted longer. A few weeks after application it seems to be wearing off unevenly. Also it was difficult to get a good buffing on the windshield after the first application. Once it rained the wipers seemed to even it out though."},{"overall":5,"summary":"gotta love it","reviewText":"great stuff to have when it starts to rain.  Don't need it too often in So Cal, but when it does rain, it helps a lot with visibility, especially if you haven't gotten around to buying new wiper blades during the rest of the year."},{"overall":5,"summary":"Surprisingly effective!","reviewText":"This was recommended to us as a way to ease keeping our windshield clean when pulling a trailer. However, on first use it did a lot more for us than expected. The first time it rained after I used RainX was on a cross-country trip last week, and amazingly it almost completely eliminated the need to use windshield wipes even during downpours. Water drops still land on the windshield, but immediately rolls off whenever the car is moving, leaving a very clear view through the windshield - much clearer than even with wipers on high. For those who have flown small planes, the effect is much the same, and why such planes don't even have wipers. (At air speeds, wind pushes raindrops off the windshield very nicely all by itself.)The only time we needed to use the wipers in several days of rain and snow driving was when passing trucks, as those covered the windshield with clouds of tiny droplets that were hard to see through.A week later, I'm noticing the windshield no longer clears itself at speeds under 40 MPH, so it may be due for another treatment, but still stays nicely clear at highway speeds, and is very easy to clear at lower speeds with a single pass of the wipers."},{"overall":5,"summary":"works great","reviewText":"Fairly easy to apply and works really well. Have never used any other glass treatment to compare it againsts but this does the job."},{"overall":5,"summary":"Rain-X 800002243 Glass Treatment- 7 oz.","reviewText":"Rain-X 800002243 Glass Treatment- 7 oz.It's simple, this stuff works great when applied correctly, the rain will slide right off!"},{"overall":5,"summary":"rainx works","reviewText":"works great ....you do not have to use your wipers as much...water rolls right off"},{"overall":4,"summary":"Nice product for your vehicle","reviewText":"Product definitely works as described.  Have used this in the past on all of my vehicles (3 over the last 16 years) and it does a great job of clearing your windshield\/windows of rain and misting.During light rains or when the roads are wet and mist is kicked up from the tires on the vehicle in front of you, this does a great job of keeping the beading moving up and off of the windows to the point that you don't really even need your wipers.  In moderate or heavy rains, it does a great job of keeping the water beaded up so vision isn't as reduced as it is on untreated windows.I docked one star though because i've found (thru multiple vehicles and uses) that my wiper blades doesn't seem to last as long after it has been applied.  I've also spoken with multiple friends who reported the same issue.  I haven't used this in conjunction with the RainX wiper blades so maybe that isn't an issue if you use them, but it is def noticeable with other commons brands... From the cheapest ones to the premium ones, it seems to affect the life of them all.That being said, i now only apply to the side windows, moonroof and mirrors of my vehicles. The beading the product causes helps keep the rain off which minimizes water spots as well.  Another plus especially in the spring when pollen is rampant and not washed away with constant &#34;April Showers&#34;."},{"overall":5,"summary":"Love Rain-X","reviewText":"Rain-X makes terrible wipers, but you don't need them if you put enough of this on.Tip: don't put it on the side windows, unless you want all the rainwater rushing up into your car whenever you crack them open."},{"overall":5,"summary":"Wow!","reviewText":"I never used this product, but have been told by many who have to try it and I wont be disappointed. I applied with a paper towel after each wash and I can say when it rains the water seems to fly off the windshield as if it were being pushed off with an air dryer. Each application seems to last very well for about 2-3 weeks or in between each wash. Try it and you wont be disappointed."},{"overall":2,"summary":"You get what you pay for.","reviewText":"Bought this for my spare tire on my utility trailer. Very inexpensive (cheap), flimsy and loose fitting. Seems like it can be broken off easily. Will probably end up getting a cable lock. This device doesn't really give me a sense of security. I suppose for only five bucks you get what you pay for."},{"overall":5,"summary":"Master Lock","reviewText":"Master Lock 262 DAT Chrome Lug Nut Style Spare Tire Lock is a simple to use and reasonable sturdy product.  Good value"},{"overall":4,"summary":"Adequate SUV spare tire lock","reviewText":"More for slowing down an amateur thief. Lug nuts that require a special tool are more secure. Had to grind away a bit of the shell due to interference with the wheel casting shape."}]