[{"overall":5,"summary":"for cars and pickups","reviewText":"these are good enough to get most motorized vehicles up and running, for semi and farm equipment, get solid copper."},{"overall":5,"summary":"No Brainer, Easy to Use, Sturdy","reviewText":""},{"overall":5,"summary":"Love It!","reviewText":"This was exactly what I needed for transporting my fishing kayak in the bed of my F-150. Easy to assemble and works great!"},{"overall":3,"summary":"average","reviewText":"this product does what it is supposed to do, but, I am not real happy with the quality of construction."},{"overall":2,"summary":"Does what it is supposed to","reviewText":"I would not buy this product again. It does what it should but If I had to do it again I would just stick with detaling microfiber towels from Viking\/Cobra."},{"overall":5,"summary":"What to say","reviewText":"Takes the dust off my car without leaving any streaking that some report with other brands. Just don't press real hard."},{"overall":5,"summary":"california duster","reviewText":"As we all know, dust gets over your rides in the garage, and is nice to be able to dust it off instead of complete re-detail!."},{"overall":5,"summary":"Must have for keeping your car cleaner between washes","reviewText":"Amazingly wipes off dust keeping your car cleaner between washes. If you have a black car, you want to buy this product and use it often."},{"overall":5,"summary":"works great","reviewText":"One of the best things I have bought to keep the inside of my car clean and looking new.  I recommend this for everyone."},{"overall":3,"summary":"Leaves red lint. Good otherwise","reviewText":"Bought this for my 2013 Evo x gsr. It left red lint all over my dash. If using in the house I'm sure it's fine as you won't notice. But this brush DOES leave red fibers behind"},{"overall":5,"summary":"great buy","reviewText":"this scanner works just like they say you have everything you need to scan your auto. WORTH EVERY PENNY!!"},{"overall":5,"summary":"Cheap and works","reviewText":"This is cheap and it feels cheap, but it works and thats all that matters. I have one on the floor and two on the ceiling for months."},{"overall":5,"summary":"Well built and looks nice","reviewText":"This product did a great job of balancing the temperatures throughout my home by correcting the direction of the air flow. The magnets are super strong and the materials super clear."},{"overall":5,"summary":"Works great","reviewText":"I added this to my spare on my boat trailer. It was plenty long and built well. Not much else to say."},{"overall":5,"summary":"Very useful and effective!","reviewText":"This works perfectly and sets my mind at ease with all the light fingered individuals out there ready to lift your battery, propane tank and whatever else they can get their hands on.."},{"overall":3,"summary":"Just OK","reviewText":"This lock will only suffice to keep honest people honest.  It is far too easy to just cut the cable.  It is however a good deterrent.  I still would recommend it just for it's deterrent aspect."},{"overall":5,"summary":"great","reviewText":"This is just what I was looking for,  perfect size for the spare on my 90 4runner.  Looped it through the spaces in the wheel and locked in the back.  Nice for the added security."},{"overall":4,"summary":"Receiver lock","reviewText":"Considering this is made in China, it is a quality product, too bad all my locks are keyed to the some number"},{"overall":5,"summary":"I like it so far, very well made. I oiled it up good before placing it on my vehicle","reviewText":"So far I like this lock set up, I live in the Four Corners area of NM, I hope to not have the rusting problems some reviewers have had in the wet slushy climates."},{"overall":5,"summary":"rain-X awesome","reviewText":"I can't say enough about the quality and benefit of rain-x for treatment on my windshields.  my cars and bikes love it."},{"overall":5,"summary":"works great","reviewText":"Fairly easy to apply and works really well. Have never used any other glass treatment to compare it againsts but this does the job."},{"overall":5,"summary":"Rain-X 800002243 Glass Treatment- 7 oz.","reviewText":"Rain-X 800002243 Glass Treatment- 7 oz.It's simple, this stuff works great when applied correctly, the rain will slide right off!"},{"overall":5,"summary":"rainx works","reviewText":"works great ....you do not have to use your wipers as much...water rolls right off"},{"overall":5,"summary":"Master Lock","reviewText":"Master Lock 262 DAT Chrome Lug Nut Style Spare Tire Lock is a simple to use and reasonable sturdy product.  Good value"},{"overall":4,"summary":"Adequate SUV spare tire lock","reviewText":"More for slowing down an amateur thief. Lug nuts that require a special tool are more secure. Had to grind away a bit of the shell due to interference with the wheel casting shape."},{"overall":4,"summary":"Seems lightweight, but should be fine","reviewText":"I purchased this lock for the spare tire on my trailer.  It seems like it could be broken without too much effort, but should help deter theft by being there."},{"overall":4,"summary":"good price","reviewText":"Works like it was intended for."},{"overall":4,"summary":"Works as Described","reviewText":"Just installed the lock on my trailer nose mounted spare tire. After installing, it obviously works as described in the ad description. So far, I am satisfied with the item."},{"overall":5,"summary":"Perfect for small openings","reviewText":"This is smaller then I thought for a funnel,yet it is useful more then I thought it would be.  Such as oil in the lawnmowers."},{"overall":5,"summary":"Small and works","reviewText":"This is a small funnel, It will work for just abought any task.Small and easy to store in a zip lock bag to keep it clean."},{"overall":5,"summary":"Five Stars","reviewText":"A dollar? I stole this. hehehee"},{"overall":5,"summary":"Small.. works well.","reviewText":"Perfect funnel to pour oil into your crankcase..  This funnel can be used for other purposes of course,.. but I bought it for pouring quart oil into my crankcase."},{"overall":5,"summary":"Perfect for putting oil in my Robin Subaru RG3200is portable generator","reviewText":"I'd previously purchased this w\/o having an actual use for it. Turned out to be practically custom made for putting oil in my Subaru inverter\/generator."},{"overall":5,"summary":"Motorcycle approved","reviewText":"Got this for oil changes on my Victory Vision. It works well but you do have to poor slow as to not overflow the funnel. It is a good length and offered an easy tool for use with my motorcycle."},{"overall":5,"summary":"Your go to funnel.","reviewText":"Priced right and Just right for the longer reach needed for todays cars and trucks. Buy two or 3 they are so handy.Makes it easy to fill hard to reach items such as mowers UTV'S etc."},{"overall":5,"summary":"great","reviewText":"great little funnel, long narrow output is good for transmission fluid or other stuff similar with a small opening not easy to get to."},{"overall":5,"summary":"Battery Charger","reviewText":"have this permanently hooked up to my car battery.  when car sits long time, I just plug it in and works perfect.  have 1 for each car, never fails."},{"overall":5,"summary":"Perfect fit","reviewText":"They fit perfectly onto the vehicle and or trailer wire when not in use. With the retaining loop they stay with the connectors when you are connected vehicle to trailer."},{"overall":5,"summary":"4 way plug covers","reviewText":"These fit perfectly and are easy to use and keep your connector clean and dry when not in use.  Great buy."},{"overall":5,"summary":"Hopkins 48735 4Wire Flat Replacement Dust Covers","reviewText":"Well they work! Easy to put on. Might not fit some ends that are not rounded. (to bulky to slide in)"},{"overall":5,"summary":"Work great...","reviewText":"These work perfectly on both ends of the connection for my motorhome and trailer.  They protect the contacts very well.  I highly recommend them."},{"overall":4,"summary":"Good covers","reviewText":"Good way to cover those vulnerable connectors for my trailer.  Works perfectly for the 4-pole connector and should keep problems away."},{"overall":4,"summary":"What can I say","reviewText":"They keep the contacts clean and lubricated however they are both the same and not a matched pair for vehicle and trailer."},{"overall":5,"summary":"Five Stars","reviewText":"The 4Wire Flat Replacement Dust Covers help keep the ends clean from road dirt."},{"overall":5,"summary":"works as advertised","reviewText":"Works as advertised and the price is very good. A bit hard to lock and unlock but not enough to matter. Hopefully I'll never find out how well it protects the hitch from theft!"},{"overall":5,"summary":"It works","reviewText":"It works and is much easier to lock\/unlock with the key facing you than if it is pointed to the side."},{"overall":5,"summary":"Works Great","reviewText":"I'm a huge fan of Master products & this does not let me down.  Very easy to use low profile lock to protect your trailer hitch attachments.  I love the bright blue tip."},{"overall":5,"summary":"Nice Product","reviewText":"I love this product works just how I expected to work..Dries my car faster than just using towels. So far I think it will last a while,made from good quality materials"},{"overall":5,"summary":"excellent","reviewText":"I used one of these for the last 5 years and is the best I've used to dry my cars. really is outstanding and the best for this task."},{"overall":5,"summary":"Wish I had invented it","reviewText":"This product is obviously manmade but is equal to or better than any 'natural' chamois I ever had.  It's just marvelous."},{"overall":4,"summary":"It works","reviewText":"I liked the absorber because it did not leave any streaks on my vehicle.  The material was sturdy and not flimsy."},{"overall":4,"summary":"Second one","reviewText":"I have had one of these for years and loved it. My wife didn't know what it was so she thought it was old and garbage."},{"overall":5,"summary":"Works good","reviewText":"I love drying my Evo X with these. They get all the water off and leave to streaks. Its a must have when detailing your car"},{"overall":5,"summary":"Super chamois!","reviewText":"This thing will hold a lot of water. just be sure to keep it moist inside the original tube. I will buy more of these. Just need to watch the price and buy low."},{"overall":5,"summary":"a must for home car washes","reviewText":"I have a black car so i need to dry it to avoid spots.  this works great.  holds a lot of water and takes me few min to dry whole car."},{"overall":3,"summary":"works ok","reviewText":"I've tried numerous synthetic drying towels and this one is ok.  This one seems to collect a lot of dirt which is not good for your car to wipe with."},{"overall":5,"summary":"Good car drying Chamois.","reviewText":"This dries my car very well and stops water spots from forming."},{"overall":4,"summary":"Classic good absorber","reviewText":"Keep all those sham wows. I have used Absorber Chamois for years, much better than natural ones or any other brands."},{"overall":5,"summary":"Best Chamois- Money can buy","reviewText":"this has been a must have in the detailing word. This holds SO much water and comes with a nice container to stow it away.  Quality and works excellent, does not scratch.  NEVER use another brand!"},{"overall":5,"summary":"Top coat for RV's & Boats","reviewText":"Very good finish top cost or fiberglass RV & Marine products.Goes on easy comes off clean.  I have used a light weight polisherWhen doing our camper.Last for months.  Good product."},{"overall":5,"summary":"Makes my RV happy","reviewText":"I use this on my RV and it shines great...  With something that big, I also recommend a top quality random orbital, like Griots 10765LNGCRD"},{"overall":3,"summary":"not too bad","reviewText":"They are a bit slick and need to be sand blasted or something. I would not buy these for any Tire size 15 inch or smaller. Get a 4x4 , cut it, use it."},{"overall":5,"summary":"Light and easy to use","reviewText":"We use these for our camper.  They are light weight, easy to store, and worth the money.  I feel that they are pretty durable and don't anticipate them breaking."},{"overall":4,"summary":"Functional, prevent movement of the trailer","reviewText":"match my existing wheel chocks.  A little too big a radius on the curved side for my wheels, otherwise would be a 5-star."},{"overall":5,"summary":"Wheels Chock","reviewText":"They did what they are supposed to kept my trailer from rolling away i am going to the Lynx chocks due to upgrading to the Lynx levelers."},{"overall":4,"summary":"STOP your RV dead in its track.","reviewText":"Works very well for the cost, I would recommend an attached rope to allow for easier removal from the wheels."},{"overall":5,"summary":"Five Stars","reviewText":"Great ......"},{"overall":4,"summary":"A must for RVers","reviewText":"Wheel chocks are a must for every Rver.  This is of particular importance if you use  the tri-leveler or other similar device."},{"overall":3,"summary":"Advertise wrong","reviewText":"These were advertised as sold in a pair yet only one came.  I will need to order a second I guess.  They also appear plastic."},{"overall":5,"summary":"Perfect","reviewText":"They do exactly what you want them to and show no signs of breaking after weekly moves and daily use for almost a year."},{"overall":5,"summary":"wheel chock","reviewText":"This is a well built wheel chock. It's made out of thick plastic. I accidentally ran it over with my car. And it held up perfectly!"},{"overall":5,"summary":"yellow plastic wheel chocks","reviewText":"Five stars because they are lightweight, inexpensive and have a hole for a rope; tie two together, pull both at the same time.  Ordered four for tandom axle trailer."},{"overall":4,"summary":"Great chocks","reviewText":"works well and holds fast and steady. I am really surprised by the light weight and sturdy construction. Will buy them again for the other things i have."},{"overall":5,"summary":"Great","reviewText":"Just don't plan to pull it out when the tires are resting against it - the grips really dig in and with 2 on the axle and a slight grade they work perfectly."},{"overall":4,"summary":"They hold","reviewText":"I bought 4 of these to change the rear shocks on my S2000. They work as advertised."},{"overall":5,"summary":"It's a wheel chock!","reviewText":"It's bigger and feels more secure then our older pair of wheel chocks.Holds our trailer in place with no issues. Not much else to say for such a simple product."},{"overall":5,"summary":"Works well","reviewText":"Works well, keeps the trailer from moving after disconnecting from the tow vehicle.  These are light weight, compact, and easily stored in the basement compartment"},{"overall":4,"summary":"Nice Wheel Chock","reviewText":"About what you would expect, not super heavy duty but serve their purpose.  i plan to pick up a few more to round out the set."},{"overall":5,"summary":"Wheel Chocks","reviewText":"The price and appears to meet all our needs.Appears well made and we are happy with the sent product. Thank you."},{"overall":5,"summary":"Great Wheel Chocks - Great Price - Made in USA!","reviewText":"These are well made, inexpensive, and work great. They are quality made in USA!And they had no shipping charges if added onto an existing Amazon order."},{"overall":5,"summary":"This will allow me to have the option of several size tow-balls available quickly.","reviewText":"This will be a useful item to have around. In the past I had to carry both an 1 7\/8 and a 2 5\/16 ball mount in the truck. Too much iron! Now I just change out the ball and I'm ready."},{"overall":5,"summary":"Best balls since....balls","reviewText":"These things are super cool. Makes having 3 different hitches a time of your life you'll look back at with shame."},{"overall":2,"summary":"bad design","reviewText":"The &#34;feet&#34; on this bar slides off the truck bed sides and makes it worthless.When the ratchet is extended, the mechanism for that ends up out of arms reach when standing outside the truck."},{"overall":4,"summary":"Keeper Cargo Bar","reviewText":"Nice cargo bar for the price. Easy to use and racheting works good. Careful of those fingers as they can get smashed!"},{"overall":4,"summary":"Keeps you snuggley warm.","reviewText":"Happy with it so far. Wife likes it. I keep one for a spare in the car in case of bad weather."},{"overall":3,"summary":"Decent for a NY winter","reviewText":"I bought this with a cold winter in mind, being in my car can be cold sometimes after I cut the ignition off waiting for someone.The switch went bad after a month of medium use (2-3 times a week)."},{"overall":5,"summary":"Exactly what I needed","reviewText":"This travel blanket is awsome.  My wife loves it. She does not have heated seates so this is the next best thing.  Plugs into the 12 volt power supply"},{"overall":5,"summary":"IMPROVES MPG FOR REAL!","reviewText":"Installed this air filter on my 2013 Silverado and immediately realized a gain of approx. 2 MPG. Took about 10 minutes to install."},{"overall":4,"summary":"I use it in every one of my cars","reviewText":"I use it in every one of my cars! Fits well and its washable\/reuse for the life of the car."},{"overall":5,"summary":"Great deal!","reviewText":"I looked around for a better price but Amazon had the best number! I have one in both cars and soon as I get time I will be building a K&N set-up for my other vehicle as there is not one made for it"},{"overall":5,"summary":"Nice replacement.","reviewText":"I cant attest to any power gains but I do like K&N's product line. I have a K&N filter in all of my vehicles."},{"overall":5,"summary":"Best Hose Nozzle Ever!!!!","reviewText":"I've been using these hose nozzles for years, you won't find a better nozzle anywhere. Don't hesitate, buy a few you will love them."},{"overall":5,"summary":"Crazy nice for high delivery hoses","reviewText":"This is a must have for those with excellent water pressure and volume and a good hose. I highly recommend this."},{"overall":5,"summary":"mini firefighter's hose","reviewText":"Solid piece of equipment, I don't think I'll ever buy the other \"garden\" variety hose head anymore....WOW I just wrote review on a hose head!!!That saying something"},{"overall":5,"summary":"Tough and easy to use","reviewText":"This is not a replacement for the amazing griots garage one, but its also a 5th of the price. Works well, takes abuse and seems built to last."},{"overall":5,"summary":"Excellent","reviewText":"So easy to use and turn on and off. It dose not burn your hand like the others do when left out in the sun."},{"overall":5,"summary":"Great.","reviewText":"This thing is bulilt to last. I love this nozzle, it is very durable and works great. I did not have a leak for over a year now."},{"overall":5,"summary":"Good product!","reviewText":"Used these for my Civic speakers and bundled with the bulk pack does wonders for dampening sound and keeping out road noise! Great purchase!"},{"overall":5,"summary":"Great choice!!","reviewText":"Purchased for 2010 Challenger. Installed by HyTech Audio in Houston, Texas. No road noise heard only music. Picture perfect sound."},{"overall":5,"summary":"Great Product makes huge difference !!","reviewText":"I used this on my Burgman 650 scooter putting in speakers - major difference.This stuff real makes the area around the speakers thick giving better depth of sound...also takes out the rattles."}]